
// 本地歌曲数据
var localData = [
  {
    "FileHash": "5E7F00CD020F40A54C4AFAF88EF791F7",
    'seconds': "04:18",
    "author_name": "庄心妍",
    "song_name": "不安",
    "lyrics": "[00:00.34]庄心妍 - 不安\r\n[00:01.30]作词：宋普照\r\n[00:02.16]作曲：郑建浩\r\n[00:03.12]编曲：蔡晓恩\r\n[00:04.04]吉他：劳国贤\r\n[00:05.00]和音：陈聆子\r\n[00:06.01]混音：蔡晓恩\r\n[00:19.01]在分别后第几个星期\r\n[00:23.31]我开始去关注你那边的天气\r\n[00:29.33]有时候晴天我这边下雨\r\n[00:34.70]你在的城市没我的孤寂\r\n[00:40.37]就在最近这些日子里\r\n[00:44.68]断断续续地我失去你的消息\r\n[00:50.65]每当我想你想对你去关心\r\n[00:56.25]却守着孤独等不到你 回复甜蜜\r\n[01:05.97]是我太过爱你 才有不安的心理\r\n[01:11.33]太想去拥抱你 才会掉进了恐惧\r\n[01:16.69]你生活的空间 有没有时间回忆\r\n[01:22.36]还是离开我后有了新的知己\r\n[01:27.31]是我太过爱你 才有不安的情绪\r\n[01:32.57]保持这样距离 让我无法去抗拒\r\n[01:38.04]只想你能知道 你还是我的唯一\r\n[01:43.70]没我陪的时间就别把我忘记\r\n[01:51.38]我才安心\r\n[02:16.29]在分别后第几个星期\r\n[02:20.64]我开始去关注你那边的天气\r\n[02:26.60]有时候晴天我这边下雨\r\n[02:31.97]你在的城市没我的孤寂\r\n[02:37.69]就在最近这些日子里\r\n[02:42.00]断断续续地我失去你的消息\r\n[02:47.98]每当我想你想对你去关心\r\n[02:53.64]却守着孤独等不到你 回复甜蜜\r\n[03:03.30]是我太过爱你 才有不安的心理\r\n[03:08.61]太想去拥抱你 才会掉进了恐惧\r\n[03:14.02]你生活的空间 有没有时间回忆\r\n[03:19.68]还是离开我后有了新的知己\r\n[03:24.68]是我太过爱你 才有不安的情绪\r\n[03:29.95]保持这样距离 让我无法去抗拒\r\n[03:35.36]只想你能知道 你还是我的唯一\r\n[03:40.98]没我陪的时间就别把我忘记\r\n[03:48.73]我才安心\r\n",
    "img":"http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180302\/20180302142740562.jpg",
    "play_url":"http:\/\/fs.w.kugou.com\/201805151611\/837c7dc75c732bc398db1985556c4157\/G129\/M08\/13\/01\/wQ0DAFrmi-qAZ5UYAD8DtkRahWM357.mp3"
  },
  {
    "FileHash": "CD572A0A3BBCA8553BBB5156FFB84018",
    'seconds': "05:02",
    "author_name": "王俊凯",
    "song_name": "圆梦一代",
    "lyrics": "[00:00.37]王俊凯 - 圆梦一代\r\n[00:01.64]作词：庄庆鸿\r\n[00:02.50]作曲：刘进\r\n[00:23.29]你是不是像我一样满身泥泞\r\n[00:28.56]但不需要任何人的同情\r\n[00:33.89]路上有了朋友有远方雪岭\r\n[00:39.30]再大的雨都是用力地活过的风景\r\n[01:11.34]你是不是像我一样微如尘埃\r\n[01:16.57]但也酝酿最独特的花儿开\r\n[01:21.95]哪怕命运辜负\r\n[01:24.57]一千次被看轻\r\n[01:27.25]我也不辜负一期一会的生命\r\n[01:33.73]我就是我 自己的王\r\n[01:38.95]真正需要的时候毫不犹豫担当\r\n[01:44.36]我的中国我站立的地方\r\n[01:49.62]对他的爱没有什么能够阻挡\r\n[01:54.99]她是软肋又像盔甲\r\n[02:00.67]是舌尖上的香\r\n[02:02.64]又是心里的光\r\n[02:05.73]我就是我 圆梦一代\r\n[02:11.04]从来没有这么靠近千百年的梦想\r\n[02:16.00]我们去闯\r\n[02:39.33]你是不是像我一样满身泥泞\r\n[02:44.59]但不需要任何人的同情\r\n[02:49.87]路上有了朋友有远方雪岭\r\n[02:55.26]再大的雨都是用力地活过的风景\r\n[03:00.47]你是不是像我一样微如尘埃\r\n[03:05.83]但也酝酿最独特的花儿开\r\n[03:11.24]哪怕命运辜负\r\n[03:13.93]一千次被看轻\r\n[03:16.55]我也不辜负一期一会的生命\r\n[03:23.09]我就是我 自己的王\r\n[03:28.25]真正需要的时候毫不犹豫担当\r\n[03:33.61]我的中国我站立的地方\r\n[03:38.92]对他的爱没有什么能够阻挡\r\n[03:44.35]她是软肋又像盔甲\r\n[03:49.97]是舌尖上的香\r\n[03:51.95]又是心里的光\r\n[03:54.98]我就是我 圆梦一代\r\n[04:00.31]从来没有这么靠近千百年的梦想\r\n[04:05.70]我就是我 自己的王\r\n[04:10.96]真正需要的时候毫不犹豫担当\r\n[04:16.32]我的中国我站立的地方\r\n[04:21.59]对他的爱没有什么能够阻挡\r\n[04:27.01]她是软肋又像盔甲\r\n[04:32.62]是舌尖上的香\r\n[04:34.54]又是心里的光\r\n[04:37.58]我就是我 圆梦一代\r\n[04:42.98]从来没有这么靠近千百年的梦想\r\n[04:48.04]我们去闯\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180224\/20180224183052916.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151729\/b6b8db857624f93f2120c3f20c049a66\/G132\/M0A\/04\/10\/xA0DAFrq6o6AS5NfAEm_AEjGKgI513.mp3"
  },
  {
    "FileHash": "5A981124777595DDB9DCE53A658DEA9F",
    "author_name": "金志文",
    "song_name": "莽荒",
    'seconds': "03:56",
    "lyrics": "[00:00.02]金志文 - 莽荒\r\n[00:00.98]作词：张旭\r\n[00:01.73]作曲：张旭\r\n[00:02.49]编曲：廖正星\r\n[00:03.44]制作人：李进\r\n[00:04.40]吉他：廖正星\r\n[00:05.35]贝斯：韩阳\r\n[00:06.16]鼓：王澜\r\n[00:06.81]合声：李进、张旭、刘雨潇\r\n[00:08.82]录音师：甄浩@好听音乐\r\n[00:10.75]混音师：王辰@ flying ear studio\r\n[00:30.28]雪\r\n[00:31.78]纯白的忧伤\r\n[00:35.10]蔷薇的芬芳\r\n[00:38.77]泪落两行\r\n[00:43.50]沙\r\n[00:45.00]掩盖或遗忘\r\n[00:48.42]阴谋和真相\r\n[00:52.14]谁来担当\r\n[00:56.81]剑\r\n[00:58.47]缠绕在心上\r\n[01:01.49]挥不尽荣光\r\n[01:05.21]如泣如唱\r\n[01:10.13]叹\r\n[01:11.79]命运太跌宕\r\n[01:15.05]缘起太痴狂\r\n[01:18.87]像梦一场\r\n[01:22.89]舍恩怨难断\r\n[01:24.60]岁月总难挡\r\n[01:26.02]论豪情壮志\r\n[01:27.88]与天地共享\r\n[01:30.57]无畏无惧携手闯\r\n[01:33.18]飙到地老天荒\r\n[01:36.15]当硝烟散尽\r\n[01:37.96]跌落进时光\r\n[01:39.43]若至真至幻\r\n[01:41.24]热血染沙场\r\n[01:43.71]一路笑傲四野八荒\r\n[02:03.57]雪\r\n[02:05.18]纯白的忧伤\r\n[02:08.10]蔷薇的芬芳\r\n[02:12.12]泪落两行\r\n[02:16.94]沙\r\n[02:18.45]掩盖或遗忘\r\n[02:21.87]阴谋和真相\r\n[02:25.39]谁来担当\r\n[02:30.21]剑\r\n[02:31.87]缠绕在心上\r\n[02:34.99]挥不尽荣光\r\n[02:38.81]如泣如唱\r\n[02:43.48]叹\r\n[02:45.19]命运太跌宕\r\n[02:48.46]缘起太痴狂\r\n[02:52.13]像梦一场\r\n[02:56.29]舍恩怨难断\r\n[02:57.85]岁月总难挡\r\n[02:59.30]论豪情壮志\r\n[03:01.21]与天地共享\r\n[03:03.77]无畏无惧携手闯\r\n[03:06.59]飙到地老天荒\r\n[03:09.50]当硝烟散尽\r\n[03:11.21]跌落进时光\r\n[03:12.76]若至真至幻\r\n[03:14.36]热血染沙场\r\n[03:17.34]一路笑傲四野八荒\r\n[03:21.87]莽荒之上\r\n[03:24.98]日出东方\r\n[03:28.50]俯瞰众生\r\n[03:32.17]和苍茫\r\n[03:34.94]莽荒之上\r\n[03:38.57]侠骨柔肠\r\n[03:41.82]不负天下\r\n[03:45.22]和离殇\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180122\/20180122114917601.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151707\/f01e558b2880323a64ca87d6ba9abf37\/G132\/M02\/10\/01\/ZJQEAFrq2P2AUJKSADnLxJycKKk236.mp3"
  },
  {
    "FileHash": "C2CD2967F9D022F744035301B72725E1",
    "author_name": "张碧晨",
    "song_name": "听雪",
    'seconds': "03:55",
    "lyrics": "[00:00.72]张碧晨 - 听雪(电视剧《烈火如歌》 如歌情感主题曲)\r\n[00:03.84]作词：刘畅\r\n[00:04.50]作曲：谭旋\r\n[00:05.10]编曲：陈沁扬\r\n[00:05.91]吉他：高飞\r\n[00:06.51]贝斯：蔡科俊\r\n[00:07.27]弦乐团：国际首席爱乐乐团\r\n[00:09.09]录音：马涛\r\n[00:09.74]混音：周天澈\r\n[00:10.55]和声：邱芷玲\r\n[00:11.31]制作人：谭旋\r\n[00:12.12]录音棚：谭旋音乐工作室\r\n[00:30.07]这一别凉风寄来离歌\r\n[00:35.87]昨日过往成说听不得\r\n[00:43.18]无人陌花香熄了灯火\r\n[00:49.21]回忆手里握着流成河\r\n[00:56.72]梨花飘落这年又添一色\r\n[01:02.51]如你素衣斑驳泪无辙\r\n[01:09.86]千言万语字字不离不舍\r\n[01:16.42]转身又能对谁说\r\n[01:23.37]眼看细雪没入无情的岁月\r\n[01:29.47]却等来你一句勿忘的留言\r\n[01:36.22]旧梦还春为何如昙花一现\r\n[01:43.40]良辰折减剩残雪\r\n[01:56.43]泯恩怨怎用离人纪念\r\n[02:02.82]三分冷七分烈到哪天\r\n[02:09.92]弦断之年借花期盼皎洁\r\n[02:16.18]我听的雪正冬眠\r\n[02:23.40]常羡人间深深几许的尘缘\r\n[02:29.45]我等待这红尘有你的流年\r\n[02:36.19]梦散之前让我记下你的脸\r\n[02:43.34]往昔留言过云烟\r\n[02:49.93]眼看细雪没入无情的岁月\r\n[02:55.88]却等来你一句勿忘的留言\r\n[03:02.95]旧梦还春为何如昙花一现\r\n[03:10.04]良辰折减剩残雪\r\n[03:16.55]闻花思雪又一年\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20170106\/20170106171217388.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151740\/362f1fb0835a259f2cd82a827b5c1c31\/G123\/M01\/01\/14\/uw0DAFqfpm2AHt86ADmeFT1BtA8652.mp3"
  }, {
    "FileHash": "BE45F30528B11C81F52DABD37BDA1EDC",
    "author_name": "吉克隽逸",
    "song_name": "伤情",
    'seconds': "03:56",
    "lyrics": "[00:00.28]吉克隽逸 - 伤情\r\n[00:01.19]作词：江林峰\r\n[00:01.91]作曲：Enbagen\r\n[00:02.41]编曲：江林峰、Hangmin Joh (韩国)\r\n[00:04.08]合声：Enbagen\r\n[00:04.59]混音：衫山健司(日本)\r\n[00:06.05]弦乐：中国国家交响乐团\r\n[00:07.42]吉他：劳国贤\r\n[00:08.18]尺八：李林峰\r\n[00:08.99]古筝：肖曄霏\r\n[00:09.80]古琴：肖曄霏\r\n[00:10.61]笛子：丁晓逵\r\n[00:11.47]琵琶：高思超\r\n[00:12.28]录音：王傲然\r\n[00:20.92]风消在莽荒之巅\r\n[00:25.89]花已缺 人离别\r\n[00:33.89]星峰下几世轮回\r\n[00:38.54]思念成堆 痴心不退\r\n[00:45.82]相隔千年的眼泪\r\n[00:49.06]看尽落花忘不回\r\n[00:51.84]摇摇欲坠 难辨是非\r\n[00:58.72]前世萦绕的眷恋\r\n[01:01.85]奈何今生更浓烈\r\n[01:04.53]凝情可贵 纵然成灰\r\n[01:10.70]一念长星只为你倾泻\r\n[01:14.65]落入虚无 化成了劫\r\n[01:17.78]余生难度心中情难绝\r\n[01:23.04]多凄切\r\n[01:24.21]朱弦与胧月分辉\r\n[01:27.45]余音绕不尽所有思念\r\n[01:32.25]回忆无限\r\n[01:38.63]伤情太美\r\n[01:53.73]风消在莽荒之巅\r\n[01:58.64]花已缺 人离别\r\n[02:06.64]星峰下几世轮回\r\n[02:11.29]思念成堆 痴心不退\r\n[02:18.67]相隔千年的眼泪\r\n[02:21.86]看尽落花忘不回\r\n[02:24.54]摇摇欲坠 难辨是非\r\n[02:31.43]前世萦绕的眷恋\r\n[02:34.68]奈何今生更浓烈\r\n[02:37.26]凝情可贵 纵然成灰\r\n[02:43.53]一念长星只为你倾泻\r\n[02:47.47]落入虚无 化成了劫\r\n[02:50.61]余生难度心中情难绝\r\n[02:55.87]多凄切\r\n[02:56.93]朱弦与胧月分辉\r\n[03:00.22]余音绕不尽所有思念\r\n[03:05.07]回忆无限\r\n[03:13.07]长星只为你倾泻\r\n[03:16.26]落入虚无化成了情劫\r\n[03:21.02]难分难辨\r\n[03:24.71]多凄切\r\n[03:25.87]朱弦与胧月分辉\r\n[03:29.06]余音绕不尽所有思念\r\n[03:33.82]回忆无限\r\n[03:40.21]伤情太美\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180226\/20180226160233645.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151808\/729bd7064383c434b060157632173824\/G125\/M03\/00\/01\/HYcBAFrhmaqAfH_cADm0tNwV7lY464.mp3"
  },
  {
    "FileHash": "A84B22E224653BDFC41BDA6C5D877187",
    "author_name": "冯提莫",
    'seconds': "03:34",
    "song_name": "哼",
    "lyrics": "[00:00.46]冯提莫 - 哼\r\n[00:01.12]作词：姚烨\r\n[00:01.73]作曲：姚烨\r\n[00:02.34]编曲：班志伟、姚烨\r\n[00:03.50]制作人：姚烨\r\n[00:04.26]吉他：袁志鹏\r\n[00:05.12]和声：姚烨\r\n[00:05.83]录混音：王辰\r\n[00:06.64]母带：David kutch\r\n[00:07.34]监制：暗杠\r\n[00:10.43]还习惯留着身旁的空位\r\n[00:15.09]还习惯成双成对的搭配\r\n[00:19.48]还喜欢没有加糖的咖啡\r\n[00:23.93]喜欢用类似我们的称谓\r\n[00:28.43]一个人去看电影更容易流泪\r\n[00:32.88]一个人走走停停慌张的可悲\r\n[00:37.32]你曾说注定失去的最美\r\n[00:41.72]放飞的鸟别再等它归回\r\n[00:46.15]等梦醒来遗憾留在门外\r\n[00:50.60]我不是哭着还等糖的小孩\r\n[00:55.05]过期的爱越紧握越伤害\r\n[00:59.51]那不如就让期待结束无奈\r\n[01:03.56]噢爱的词汇没有卑微\r\n[01:12.62]噢遗憾的美等时间给\r\n[01:39.35]粉色的指甲闪耀的吊坠\r\n[01:43.95]都为你换成一堆质感灰\r\n[01:48.40]那不是我不懂成熟和美\r\n[01:52.84]是我更珍惜美前的纯粹\r\n[01:57.31]爱得越深的人就越没有防备\r\n[02:01.76]看得越淡的人会越容易撤退\r\n[02:06.12]曾想你是我一生的依偎\r\n[02:10.68]你要的自由我流着泪给\r\n[02:15.08]等梦醒来遗憾留在门外\r\n[02:19.48]我不是哭着还等糖的小孩\r\n[02:23.93]过期的爱越紧握越伤害\r\n[02:28.38]那不如就让期待结束无奈\r\n[02:32.69]噢爱的词汇没有卑微\r\n[02:41.49]噢笑着流泪纪念伤悲\r\n[03:17.45]等梦醒来遗憾留在门外\r\n[03:21.75]我不是哭着还等糖的小孩\r\n[03:26.23]过期的爱越紧握越伤害\r\n[03:30.63]那不如就让期待\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180327\/20180327183312661.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151722\/44bbfe35e20b2a8abafc07d728911af2\/G126\/M08\/11\/05\/HocBAFrlt6WAG9i3ADQZ3BiM8GY606.mp3"
  },
  {
    "FileHash": "AE65F8C769D972610357B4527133D7FC",
    "author_name": "佟丽娅、雷佳音",
    'seconds': "04:38",
    "song_name": "不要忘了我",
    "lyrics": "[00:00.04]雷佳音、佟丽娅 - 不要忘记我(《超时空同居》电影主题曲)\r\n[00:01.76]作词：陈曦\r\n[00:02.52]作曲：董冬冬\r\n[00:03.49]编曲：董冬冬\r\n[00:04.45]制作人：董冬冬\r\n[00:05.56]吉他：薛峰\r\n[00:06.37]长笛：倪一珍\r\n[00:07.28]钢琴：董冬冬\r\n[00:08.25]和音：王馨悦、李阳\r\n[00:09.72]录音：罗皓\r\n[00:10.53]混音：时俊峰\r\n[00:11.49]母带：时俊峰\r\n[00:16.55]刚看清了\r\n[00:20.19]爱的颜色\r\n[00:23.75]怎么舍得\r\n[00:26.23]就结束了\r\n[00:31.04]刚熟悉了\r\n[00:34.64]爱的轮廓\r\n[00:38.34]怎么忘了\r\n[00:40.57]梦有期限的\r\n[00:44.19]只怪时间\r\n[00:45.41]不给相爱的人更多选择\r\n[00:51.13]如何冷落\r\n[00:54.67]如何解脱\r\n[00:58.77]只怪甜蜜的滋味\r\n[01:02.02]刚刚才品尝过\r\n[01:05.56]就要忘了\r\n[01:09.10]就要放了\r\n[01:12.90]不要忘了我\r\n[01:16.35]不要抛下我\r\n[01:19.99]把时间定格\r\n[01:23.48]在此时此刻\r\n[01:27.18]不要忘了我\r\n[01:30.87]不要离开我\r\n[01:34.62]记住我说过\r\n[01:38.17]会让你快乐\r\n[01:43.14]怕再没有人像我一样爱过\r\n[01:49.69]更怕有个人像我一样爱着\r\n[01:56.59]不要忘了我\r\n[01:59.88]不要抛下我\r\n[02:03.68]把时间定格\r\n[02:07.17]在此时此刻\r\n[02:10.83]不要忘了我\r\n[02:14.48]不要离开我\r\n[02:18.13]记住我说过\r\n[02:22.05]会让你快乐\r\n[02:26.85]啦啦啦啦\r\n[02:54.83]不要忘了我\r\n[02:58.14]不要抛下我\r\n[03:01.79]把时间定格\r\n[03:05.38]在此时此刻\r\n[03:08.99]不要忘了我\r\n[03:12.55]不要离开我\r\n[03:16.39]记住我说过\r\n[03:19.89]会让你快乐\r\n[03:25.07]怕再没有人像我一样爱过\r\n[03:31.48]更怕有个人像我一样爱着\r\n[03:39.50]怕再没有人像我一样来过\r\n[03:46.03]更怕有个人像我一样等着\r\n[03:52.99]不要忘了我\r\n[03:56.29]不要抛下我\r\n[04:00.00]把时间定格\r\n[04:03.45]在此时此刻\r\n[04:07.34]不要忘了我\r\n[04:10.82]不要离开我\r\n[04:14.52]记住我说过\r\n[04:21.83]会让你快乐\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20140521\/20140521194957876293.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151812\/e54cd0c8347524f6f78554826ac22161\/G126\/M0B\/1B\/19\/vg0DAFrsCMGAcRR1AEQcsO1rb0Y512.mp3"
  },
  {
    "FileHash": "AE65F8C769D972610357B4527133D7FC",
    "author_name": "张翰",
    "song_name": "如果没有你",
    'seconds': "04:50",
    "lyrics": "[00:00.00]张翰 - 如果没有你(电视剧《温暖的弦》推广曲)\r\n[00:03.28]作词：左安安、李焯雄\r\n[00:05.05]作曲：左安安\r\n[00:08.94]改编编曲：欧阳箐宇\r\n[00:10.37]音乐制作：有沐音乐(Yum Music)\r\n[00:12.09]制作人：朱金泰\r\n[00:13.20]吉他：劳国贤\r\n[00:14.17]贝斯：吴烦\r\n[00:14.98]和声：鱼椒盐\r\n[00:15.89]弦乐：国际首席爱乐乐团\r\n[00:17.67]录音：李天野\r\n[00:18.64]缩混：李天野\r\n[00:19.60]母带：Bjorn Engelmann\r\n[00:33.89]Hey我真的好想你\r\n[00:40.97]现在窗外面又开始下着雨\r\n[00:49.71]眼睛干干的有想哭的心情\r\n[00:56.47]不知道你现在到底在哪里\r\n[01:04.49]Hey我真的好想你\r\n[01:11.65]太多的情绪\r\n[01:13.78]没适当的表情\r\n[01:20.10]最想说的话我该从何说起\r\n[01:26.92]你是否也像我一样在想你\r\n[01:34.49]如果没有你\r\n[01:36.72]没有过去\r\n[01:38.57]我不会有伤心\r\n[01:42.33]但是有如果还是要爱你\r\n[01:49.97]如果没有你\r\n[01:51.85]我在哪里\r\n[01:53.78]又有什么可惜\r\n[01:57.08]反正一切来不及\r\n[02:01.01]反正没有了自已\r\n[02:05.33]Hey我真的好想你\r\n[02:12.36]不知道你现在到底在哪里\r\n[02:32.14]Hey我真的好想你\r\n[02:39.05]现在窗外面又开始下着雨\r\n[02:47.80]眼睛干干的有想哭的心情\r\n[02:54.37]不知道你现在到底在哪里\r\n[03:02.61]Hey我真的好想你\r\n[03:09.77]太多的情绪\r\n[03:11.70]没适当的表情\r\n[03:18.15]最想说的话\r\n[03:21.25]我应该从何说起\r\n[03:24.81]你是否也像我一样在想你\r\n[03:32.58]如果没有你\r\n[03:34.81]没有过去\r\n[03:36.53]我不会有伤心\r\n[03:40.35]但是有如果还是要爱你\r\n[03:47.85]如果没有你\r\n[03:49.99]我在哪里\r\n[03:51.82]又有什么可惜\r\n[03:55.48]反正一切来不及\r\n[03:58.99]反正没有了自已\r\n[04:03.51]Hey我真的好想你\r\n[04:10.69]不知道你现在到底在哪里\r\n[04:18.31]你是否也像我一样在想你\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20170717\/20170717143000820.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151746\/924333ccff00c45b577caac0a566d2af\/G126\/M09\/04\/05\/XpQEAFrr2K6AR8hAAEb1mV3IOkg369.mp3"
  },
  {
    "FileHash": "AB4DC3BEEDDCE5DD9500C15E61E64A9E",
    "author_name": "张碧晨",
    "song_name": "染",
    'seconds': "03:50",
    "lyrics": "[00:01.01]张碧晨 - 染\r\n[00:00.81]中文改编词：吕易秋\r\n[00:01.13]曲：Martin Frans Enar Landquist\/Robin Hans Bengtsson\/Tofer Brown\r\n[00:01.46]制作人：郑楠\r\n[00:01.67]编曲：郑楠\r\n[00:02.04]吉他：薛峰\/郑楠\r\n[00:02.81]和声设计：余昭源\/郑楠\r\n[00:03.21]和声：张碧晨\/余昭源\/张恋歌\r\n[00:03.71]录音：汝文博\r\n[00:03.92]录音棚：BIG.J Studio\r\n[00:04.14]混音：赵靖\r\n[00:04.32]混音棚：BIG.J Studio\r\n[00:04.53]母带：赵靖 @BIG.J Studio\r\n[00:12.26]街边自由画家换了新的风格\r\n[00:17.50]城市地标搭建起轮廓\r\n[00:21.73]玻璃墙折射出街道上的曲折\r\n[00:26.97]霓虹之下像幅抽象画作\r\n[00:34.36]是哪个色调不对\r\n[00:39.07]让画面只剩黑白灰\r\n[00:43.98]找点明亮色彩\r\n[00:46.33]重新着色涂改\r\n[00:51.27]打碎凝固化思维\r\n[00:55.72]快逃离晦暗的包围\r\n[01:00.53]崭新风格怎样调配\r\n[01:03.15]在构图中无绝对\r\n[01:06.51]用什么点缀 都无所谓\r\n[01:29.69]构图法应该怎么讲\r\n[01:34.25]毕加索也偶尔靠想象\r\n[01:39.01]怎样的色彩能表达立场\r\n[01:43.70]拥有无可替代的力量\r\n[01:48.79]打碎凝固化思维\r\n[01:53.43]快逃离晦暗的包围\r\n[01:58.11]崭新风格怎样调配\r\n[02:00.67]在构图中无绝对\r\n[02:04.06]用什么点缀都无所谓\r\n[02:08.96]怎么画都无所谓\r\n[02:11.29]怎么想也无所谓\r\n[02:12.56]Ow\r\n[02:18.46]怎么说都无所谓\r\n[02:20.74]怎么做也无所谓\r\n[02:29.80]哪个色调不对\r\n[02:34.30]让画面只剩黑白灰\r\n[02:39.18]找点明亮色彩\r\n[02:41.48]重新着色涂改\r\n[02:48.69]打碎凝固化思维\r\n[02:53.32]快逃离晦暗的包围\r\n[02:58.09]崭新风格怎样调配\r\n[03:00.64]在构图中无绝对\r\n[03:03.91]用什么点缀 都无所谓\r\n[03:12.81]快逃离晦暗的包围\r\n[03:17.30]崭新风格怎样调配\r\n[03:19.94]在构图中无绝对\r\n[03:23.16]用什么点缀 都无所谓\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20170106\/20170106171217388.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151752\/1dc95c7d7c8b266e82ed50c0e915e124\/G128\/M07\/1A\/03\/wA0DAFrfErCAMHtQADhkmW5J3Qk729.mp3"
  },
  {
    "FileHash": "CC73134943AE432E073C90E1D2793203",
    "author_name": "戚薇",
    'seconds': "04:28",
    "song_name": "第三人称",
    "lyrics": "[00:00.81]戚薇 - 第三人称\r\n[00:02.97]作词：Hush\r\n[00:04.18]作曲：Hush\r\n[00:05.53]制作人：任寒冰\r\n[00:12.27]他想知道那是谁\r\n[00:19.84]为何总沉默寡言\r\n[00:27.20]人群中也算抢眼\r\n[00:34.43]抢眼的孤独难免\r\n[00:41.71]快乐当然有一点\r\n[00:49.14]不过寂寞更强烈\r\n[00:56.31]难过时候不流泪\r\n[01:03.58]流泪也不算伤悲\r\n[01:11.78]天真以为\r\n[01:13.89]是他的独特品味\r\n[01:17.67]殊不知是他\r\n[01:20.34]难以言喻的对决\r\n[01:26.30]子母画面\r\n[01:28.57]分割上演谍对谍\r\n[01:32.71]而谁是谁\r\n[01:40.91]对于第三人称的角度而言\r\n[01:46.80]也明白其实\r\n[01:49.64]每个人都有缺陷\r\n[01:55.65]不自觉遮掩\r\n[01:59.07]多少也算\r\n[02:01.57]自然的行为\r\n[02:38.36]快乐当然有一点\r\n[02:45.46]不过寂寞更强烈\r\n[02:52.66]难过时候不流泪\r\n[02:59.98]流泪也不算伤悲\r\n[03:08.07]天真以为\r\n[03:10.39]是他的独特品味\r\n[03:14.01]殊不知是他\r\n[03:16.67]难以言喻的对决\r\n[03:22.66]子母画面\r\n[03:24.92]分割上演谍对谍\r\n[03:29.10]而谁是谁\r\n[03:37.23]对于第三人称的角度而言\r\n[03:43.12]也明白其实\r\n[03:45.78]每个人都有缺陷\r\n[03:51.41]才不断地追寻\r\n[03:55.39]更好的自己\r\n[03:59.01]直到青春\r\n[04:01.44]一定程度的浪费\r\n[04:05.01]才觉得可贵\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20171121\/20171121185715868.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151820\/41221ca009dcdf10ee67a7078ebb6b41\/G123\/M07\/04\/1B\/W5QEAFrkJoSAKCecAEGCt0tlsDs601.mp3"
  },
  {
    "FileHash": "118E879C846FC25DB9593CCEFB23D7CA",
    "author_name": "张杰",
    "song_name": "骄傲的选择",
    'seconds': "03:17",
    "lyrics": "[00:00.41]张杰 - 骄傲的选择(《QQ飞车手游》全新主题曲)\r\n[00:01.32]作词：火星电台\r\n[00:01.52]作曲：火星电台\r\n[00:01.68]编曲：火星电台\r\n[00:01.83]制作人：火星电台\r\n[00:02.03]演唱制作人：火星电台\r\n[00:02.28]录音师：Weiwei(徐威)、陈宇轩(Jovi)\r\n[00:02.59]录音室：香蕉文化录音室(上海)\r\n[00:02.94]混音工作室：Sick Glue Studios\r\n[00:03.19]混音师：Rusty Santos\r\n[00:03.35]母带工作室：Sterling Sound Studio\r\n[00:03.55]母带工程师：Chris Gehringer\r\n[00:06.77]左手握紧热血的源头\r\n[00:09.70]右手举起好胜的心\r\n[00:12.89]我从来都是享受着角逐\r\n[00:16.03]第一个冲过终点的身影\r\n[00:19.11]用力踩到底的不是机器\r\n[00:22.46]是生命的速度和激情\r\n[00:25.40]我从来不在乎从众的声音\r\n[00:28.58]除了我的引擎轰鸣\r\n[00:31.90]转弯 丢掉了失重的不安\r\n[00:36.90]童话了重复的短暂\r\n[00:39.88]赢得了又一次突破\r\n[00:42.01]自己的独特经历\r\n[00:45.64]也许你开始觉得无聊了\r\n[00:49.08]当我呼啸而过\r\n[00:52.10]这种无我的晕眩一刻\r\n[00:55.19]是我骄傲的选择\r\n[00:58.12]嘟 嘟嘟嘟嘟嘟嘟嘟\r\n[01:01.91]我骄傲的选择\r\n[01:04.29]嘟 嘟嘟嘟嘟嘟嘟嘟\r\n[01:08.13]骄傲的选择\r\n[01:13.02]左手握紧热血的源头\r\n[01:16.04]右手举起好胜的心\r\n[01:18.94]我从来都是享受着角逐\r\n[01:22.17]第一个冲过终点的身影\r\n[01:25.46]用力踩到底的不是机器\r\n[01:28.81]是生命的速度和激情\r\n[01:31.79]我从来不在乎从众的声音\r\n[01:35.00]除了我的引擎轰鸣\r\n[01:38.23]转弯 丢掉了失重的不安\r\n[01:43.09]童话了重复的短暂\r\n[01:46.38]赢得了又一次突破\r\n[01:48.35]自己的独特经历\r\n[01:53.47]也许你开始觉得无聊了\r\n[01:57.01]当我呼啸而过\r\n[01:59.89]这种无我的晕眩一刻\r\n[02:03.49]骄傲的选择\r\n[02:06.02]也许你开始觉得无聊了\r\n[02:09.56]当我呼啸而过\r\n[02:12.44]这种无我的晕眩一刻\r\n[02:16.34]骄傲的 骄傲的骄傲骄傲骄傲\r\n[02:22.31]你开始觉得无聊了\r\n[02:25.39]当我呼啸而过\r\n[02:28.17]这种无我的晕眩一刻\r\n[02:32.10]骄傲的选择\r\n[02:34.53]也许你开始觉得无聊了\r\n[02:38.02]当我呼啸而过\r\n[02:40.85]这种无我的晕眩一刻\r\n[02:44.80]骄傲的\r\n[02:47.80]嘟 嘟嘟嘟嘟嘟嘟嘟\r\n[03:09.84]骄傲的选择\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20180122\/20180122113125103.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151822\/9ab6cc94f7d0416e105e971c19193532\/G131\/M02\/0A\/13\/I4cBAFrjAkeAKl_YADBJiu8Qvz8587.mp3"
  },
  {
    "FileHash": "96AECEBBEC71A5DF6DFA20D5136B7A87",
    "author_name": "张靓颖",
    'seconds': "04:15",
    "song_name": "贪恋",
    "lyrics": "[00:00.78]张靓颖 - 贪恋\r\n[00:01.54]作词：文雅\r\n[00:02.19]作曲：万家铭\r\n[00:03.00]编曲：万家铭\r\n[00:03.91]制作人：崔迪\r\n[00:04.72]和音：万家铭、张靓颖\r\n[00:06.09]录音师：秦孟达\r\n[00:07.00]混音师：李智伟\r\n[00:07.91]录音混音室：“造音”Studio\r\n[00:21.33]逗你笑的 输给惹你哭的\r\n[00:30.94]努力快乐 才最难过\r\n[00:40.56]对我来说 有更好的选择\r\n[00:49.31]可一旦那样做\r\n[00:54.78]离你就远了\r\n[00:59.76]我伸出手 却又往回缩\r\n[01:04.92]又怕错 又害怕错过\r\n[01:09.32]贪恋 才会迷惑\r\n[01:19.09]我的意志 左右在互搏\r\n[01:24.00]想割舍 转念又不舍\r\n[01:28.55]贪恋 才更牵扯\r\n[01:57.54]你离开了 像从未到来过\r\n[02:06.85]生活满着 世界空的\r\n[02:16.43]情绪太多 各演各的角色\r\n[02:25.28]表面心平气和\r\n[02:30.79]内心戏火热\r\n[02:35.96]我伸出手 却又往回缩\r\n[02:40.69]又怕错 又害怕错过\r\n[02:45.39]贪恋 才会迷惑\r\n[02:55.04]我的意志 左右在互搏\r\n[03:00.02]想割舍 转念又不舍\r\n[03:04.62]贪恋 才更牵扯\r\n[03:14.38]我还爱着 像走火入魔\r\n[03:19.29]人睡了 梦却又醒了\r\n[03:23.78]贪恋 是谁的错\r\n[03:33.46]我的意志 在强弩之末\r\n[03:38.42]难割舍 对你的不舍\r\n[03:43.11]贪恋 你还是我的\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20170628\/20170628110356447.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151742\/b02e5e62bbfe20101161d79def279638\/G133\/M04\/0B\/19\/JYcBAFrVulyAONXVAD6Arlh4SEg134.mp3"
  },
  {
    "FileHash": "A7530CF784D47EF4EC7D6CE28D8F5F53",
    "author_name": "于文文",
    "song_name": "奉陪",
    'seconds': "05:14",
    "lyrics": "[00:00.00]于文文 - 奉陪(完整版)\r\n[00:01.39]作词：于文文、唐恬\r\n[00:02.55]作曲：于文文\r\n[00:04.96]编曲：Sean Sinclair\r\n[00:04.02]制作人：王治平\r\n[00:04.93]和声：于文文\r\n[00:05.79]和声设计：于文文\r\n[00:06.96]吉他：Sean Sinclair\r\n[00:07.71]混音：Sean Sinclair\r\n[00:17.38]认识你的时候\r\n[00:18.59]我就该跟你去上海\r\n[00:24.11]你我都很勇敢\r\n[00:25.37]没辜负风景多好看\r\n[00:30.14]浪漫的遗产 再回头看\r\n[00:36.77]爱到结尾 奉陪孤单\r\n[00:44.36]认识你的时候\r\n[00:45.63]我想的都太过简单\r\n[00:51.13]对的错的全部都\r\n[00:52.80]输给了单纯喜欢\r\n[00:57.05]我所有憔悴 疲惫 不堪\r\n[01:04.14]当回忆把灯光调暗\r\n[01:07.49]是我们电影般的桥段\r\n[01:13.59]我们怎么变成这样\r\n[01:20.33]怎么只剩遗憾收场\r\n[01:27.11]没结果 那又怎样\r\n[01:31.31]也好过不痛 不痒\r\n[01:40.64]感谢你陪我看 无常\r\n[01:47.33]让我有故事可 荒唐\r\n[01:54.17]有伤口 那又怎样\r\n[01:58.42]多得它提醒\r\n[02:04.29]我曾经爱你一场\r\n[02:19.05]认识你的时候\r\n[02:20.31]我想的都太过简单\r\n[02:25.78]对的错的全部都\r\n[02:27.40]输给了单纯喜欢\r\n[02:31.75]我所有憔悴 疲惫 不堪\r\n[02:38.88]当回忆把灯光调暗\r\n[02:42.07]是我们电影般的桥段\r\n[02:48.20]我们怎么变成这样\r\n[02:54.97]怎么只剩遗憾收场\r\n[03:01.81]没结果 那又怎样\r\n[03:05.91]也好过不痛 不痒\r\n[03:15.21]感谢你陪我看无常\r\n[03:22.01]让我有故事可荒唐\r\n[03:28.80]有伤口 那又怎样\r\n[03:33.00]多得它提醒 我曾经爱你\r\n[03:45.82]我们怎么变成这样\r\n[03:52.38]怎么只剩遗憾收场\r\n[03:59.17]没结果 那又怎样\r\n[04:03.42]也好过不痛 不痒\r\n[04:12.74]感谢你陪我看无常\r\n[04:19.42]让我有故事可荒唐\r\n[04:26.25]有伤口 那又怎样\r\n[04:30.50]多得它提醒\r\n[04:36.33]我曾经爱你一场\r\n",
    "img": "http:\/\/singerimg.kugou.com\/uploadpic\/softhead\/400\/20171222\/20171222165824304.jpg",
    "play_url": "http:\/\/fs.w.kugou.com\/201805151735\/d502e70ef83fabb1f435ea6a699257d4\/G125\/M05\/0C\/05\/vQ0DAFrQsVCAT9OqAEzEM7kh15k610.mp3"
  }
] 
/**
 * 获取搜索资讯
 */
function searchAllInformation(keyword,pageNum, callback) {
  wx.request({
    url: 'https://route.showapi.com/96-109',
    data: {
      keyword: keyword,
      page: pageNum,
      showapi_appid: '64448',
      showapi_sign: '8cda9b9113b64910bb5bd1b96a71f00b'
    },
    header: {
      'content-type': 'application/x-www-form-urlencoded'
    },
    success: function (res) {
      if (res.statusCode == 200) {
        callback(res.data.showapi_res_body.pagebean);
      }
    }
  });
}
/**
 * 获取资讯详情
 */
function getDetailInformation(id, callback) {
  wx.request({
    url: 'https://route.showapi.com/96-36',
    data: {
      id: id,
      showapi_appid: '64448',
      showapi_sign: '8cda9b9113b64910bb5bd1b96a71f00b'
    },
    header: {
      'content-type': 'application/x-www-form-urlencoded'
    },
    success: function (res) {
      if (res.statusCode == 200) {
        callback(res.data.showapi_res_body.item);
      }
    }
  });
}
/**
 * 文本笑话
 */
function getTextJokes(page,pageSize, callback) {
  wx.request({
    url: 'https://route.showapi.com/341-1',
    data: {
      page:page,
      maxResult:pageSize,
      showapi_appid: '64448',
      showapi_sign: '8cda9b9113b64910bb5bd1b96a71f00b'
    },
    header: {
      'content-type': 'application/x-www-form-urlencoded'
    },
    success: function (res) {
      if (res.statusCode == 200) {
        callback(res.data.showapi_res_body);
      }
    }
  });
}

/**
 * 图片笑话
 */
function getPictureJokes(page, pageSize, callback) {
  wx.request({
    url: 'https://route.showapi.com/341-2',
    data: {
      page: page,
      maxResult: pageSize,
      showapi_appid: '64448',
      showapi_sign: '8cda9b9113b64910bb5bd1b96a71f00b'
    },
    header: {
      'content-type': 'application/x-www-form-urlencoded'
    },
    success: function (res) {
      if (res.statusCode == 200) {
        callback(res.data.showapi_res_body);
      }
    }
  });
}
/**
 * 东话笑话
 */
function getGiftJokes(page, pageSize, callback) {
  wx.request({
    url: 'https://route.showapi.com/341-3',
    data: {
      page: page,
      maxResult: pageSize,
      showapi_appid: '64448',
      showapi_sign: '8cda9b9113b64910bb5bd1b96a71f00b'
    },
    header: {
      'content-type': 'application/x-www-form-urlencoded'
    },
    success: function (res) {
      if (res.statusCode == 200) {
        callback(res.data.showapi_res_body);
      }
    }
  });
}

module.exports = {
  localData: localData,
  searchAllInformation: searchAllInformation,
  getDetailInformation: getDetailInformation,
  getTextJokes: getTextJokes,
  getPictureJokes: getPictureJokes,
  getGiftJokes: getGiftJokes
}
